## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_ingress_v1.argocd_ingress will be created
+   resource "kubernetes_ingress_v1" "argocd_ingress" {
+       id     = (known after apply)
+       status = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-ingress"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           ingress_class_name = "istio"

+           default_backend {

+               service {
+                   name = "argocd-argo-cd-server"

+                   port {
+                       number = 80
                    }
                }
            }

+           rule {
+               host = "argocd.wayofthesys.org"

+               http {
+                   path {
+                       path      = "/"
+                       path_type = "ImplementationSpecific"

+                       backend {

+                           service {
+                               name = "argocd-argo-cd-server"

+                               port {
+                                   number = 80
                                }
                            }
                        }
                    }
                }
            }

+           tls {
+               secret_name = "argocd-secret"
            }
        }
    }

  # kubernetes_secret.argocd-tls must be replaced
-/+ resource "kubernetes_secret" "argocd-tls" {
!       data      = (sensitive value)
!       id        = "argocd/wayofthesys-org-tls" -> (known after apply)
-       immutable = false -> null
        # (1 unchanged attribute hidden)

!       metadata {
-           annotations      = {
-               "cert-manager.io/alt-names"        = "argocd.wayofthesys.org"
-               "cert-manager.io/certificate-name" = "argocd-cert"
-               "cert-manager.io/common-name"      = "argocd.wayofthesys.org"
-               "cert-manager.io/ip-sans"          = ""
-               "cert-manager.io/issuer-group"     = ""
-               "cert-manager.io/issuer-kind"      = "ClusterIssuer"
-               "cert-manager.io/issuer-name"      = "zerossl"
-               "cert-manager.io/uri-sans"         = ""
            } -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
!           name             = "wayofthesys-org-tls" -> "argo-cert" # forces replacement
!           namespace        = "argocd" -> "istio-system" # forces replacement
!           resource_version = "1226342" -> (known after apply)
!           uid              = "ea33d5e6-04ae-4135-ac01-d52f751d7f57" -> (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
